vad7/WirelessCO2_esp8266/app/web/web_int_callbacks.c
//---------------------------- output history.csv ---------------------------
typedef struct {
	uint32 	PtrCurrent; 	// ptr in the FRAM array
	time_t 	LastTime;		// Last printed time
	time_t	PreviousTime; 	// Previous printed time
	int32_t	minutes;		// How many minutes printed
	bool 	FlagContinue;	// Need continue print packed
	uint8_t OutType;		// 0 - out non zero cnts in min, 1 - kWt per day
	int32_t	len;
	int32_t	i;
	bool 	packed_flag;
	uint8_t	n;
	int16_t	previous_n;
	int32_t Sum;			// for OutType=1
	uint8_t	buf[48];
	char 	str[32];
} history_output;

/******************************************************************************
 * FunctionName : web saved flash
 * Description  : Processing the flash data send
 * Parameters   : none (Calback)
 * Returns      : none
*******************************************************************************/
void ICACHE_FLASH_ATTR web_get_flash(TCP_SERV_CONN *ts_conn)
{
    WEB_SRV_CONN *web_conn = (WEB_SRV_CONN *)ts_conn->linkd;
    // Check if this is a first round call
    if(CheckSCB(SCB_RETRYCB)==0) {
    	if(web_conn->udata_start == web_conn->udata_stop) return;
#if DEBUGSOO > 2
		os_printf("file_size:%08x ", web_conn->udata_stop - web_conn->udata_start );
#endif
    }
    // Get/put as many bytes as possible
    unsigned int len = mMIN(web_conn->msgbufsize - web_conn->msgbuflen, web_conn->udata_stop - web_conn->udata_start);
    // Read Flash addr = web_conn->webfinc_offsets, len = x, buf = sendbuf
#if DEBUGSOO > 2
	os_printf("%08x..%08x ",web_conn->udata_start, web_conn->udata_start + len );
#endif
    if(spi_flash_read(web_conn->udata_start, web_conn->msgbuf + web_conn->msgbuflen, len) == SPI_FLASH_RESULT_OK) {
      web_conn->udata_start += len;
      web_conn->msgbuflen += len;
      if(web_conn->udata_start < web_conn->udata_stop) {
        SetSCB(SCB_RETRYCB);
        SetNextFunSCB(web_get_flash);
        return;
      };
    };
    ClrSCB(SCB_RETRYCB);
//    SetSCB(SCB_FCLOSE | SCB_DISCONNECT);
    return;
}
/******************************************************************************
 * FunctionName : web saved flash
 * Description  : Processing the flash data send
 * Parameters   : none (Calback)
 * Returns      : none
*******************************************************************************/
void ICACHE_FLASH_ATTR web_get_ram(TCP_SERV_CONN *ts_conn)
{
    WEB_SRV_CONN *web_conn = (WEB_SRV_CONN *)ts_conn->linkd;
    // Check if this is a first round call
    if(CheckSCB(SCB_RETRYCB)==0) { // On initial call, проверка параметров
		if(web_conn->udata_start == web_conn->udata_stop) {
//    	    SetSCB(SCB_FCLOSE | SCB_DISCONNECT);
    	    return;
		}
#if DEBUGSOO > 2
		os_printf("file_size:%08x ", web_conn->udata_stop - web_conn->udata_start );
#endif
	}
    // Get/put as many bytes as possible
    uint32 len = mMIN(web_conn->msgbufsize - web_conn->msgbuflen, web_conn->udata_stop - web_conn->udata_start);
	copy_align4(web_conn->msgbuf + web_conn->msgbuflen, (void *)(web_conn->udata_start), len);
	web_conn->msgbuflen += len;
	web_conn->udata_start += len;
#if DEBUGSOO > 2
	os_printf("%08x-%08x ",web_conn->udata_start, web_conn->udata_start + len );
#endif
    if(web_conn->udata_start != web_conn->udata_stop) {
        SetSCB(SCB_RETRYCB);
        SetNextFunSCB(web_get_ram);
        return;
    };
    ClrSCB(SCB_RETRYCB);
//    SetSCB(SCB_FCLOSE | SCB_DISCONNECT);
    return;
}
/******************************************************************************
 * FunctionName : get_new_url
 * Parameters   : Parameters   : struct TCP_SERV_CONN
 * Returns      : string url
 ******************************************************************************/
void ICACHE_FLASH_ATTR get_new_url(TCP_SERV_CONN *ts_conn)
{
	WEB_SRV_CONN *web_conn = (WEB_SRV_CONN *)ts_conn->linkd;
	uint32 ip = 0;
	uint32 ip_ap = 0;
	uint32 ip_st = 0;
//	int z  = NULL_MODE;
	struct ip_info wifi_info;
	WIFI_MODE opmode = wifi_get_opmode();
	if(opmode == STATIONAP_MODE) {
		if((opmode & STATION_MODE) && wifi_get_ip_info(STATION_IF, &wifi_info)) {
			ip_st = wifi_info.ip.addr;
		}
		if((opmode & SOFTAP_MODE) && wifi_get_ip_info(SOFTAP_IF, &wifi_info)) {
			ip_ap = wifi_info.ip.addr;
		}
		if(((ts_conn->pcb->local_ip.addr^ip_ap) & 0xFFFFFF) == 0 || (ip_current_netif() != NULL && ip_current_netif()->ip_addr.addr == ip_ap)) {
			ip = ip_ap;
			opmode = SOFTAP_MODE;
		}
		else if(((ts_conn->pcb->local_ip.addr^ip_st) & 0xFFFFFF) == 0 || (ip_current_netif() != NULL && ip_current_netif()->ip_addr.addr == ip_st)) {
			ip = ip_st;
			opmode = STATION_MODE;
		};
	};
	opmode &= wificonfig.b.mode;
	if(opmode == WIFI_DISABLED) opmode = wificonfig.b.mode;
	if(wificonfig.ap.ipinfo.ip.addr == 0 || (opmode & SOFTAP_MODE)) {
		ip = wificonfig.ap.ipinfo.ip.addr;
#ifdef USE_NETBIOS
		netbios_name[0]='A';
#endif
	} else {
		ip = wificonfig.st.ipinfo.ip.addr;
#ifdef USE_NETBIOS
		netbios_name[0]='S';
#endif
	}
#ifdef USE_NETBIOS
	if(syscfg.cfg.b.netbios_ena) tcp_strcpy(netbios_name);
	else {
		if(ip == 0) tcp_strcpy_fd("esp8266.ru"); 
		else tcp_puts(IPSTR, IP2STR(&ip));
	};
#else
	if(ip == 0) ip = WEB_DEFAULT_SOFTAP_IP; // 0x0104A8C0
	tcp_puts(IPSTR, IP2STR(&ip));
#endif
	if(syscfg.web_port != 80) tcp_puts(":%u", syscfg.web_port);
}
/******************************************************************************
 * FunctionName : web_callback
 * Description  : callback, DO NOT send thru tcp_puts more than SCB_SEND_SIZE (128 bytes)!
 * Parameters   : struct TCP_SERV_CONN
 * Returns      : none
 ******************************************************************************/
void ICACHE_FLASH_ATTR web_int_callback(TCP_SERV_CONN *ts_conn, uint8 *cstr)
{
    WEB_SRV_CONN *web_conn = (WEB_SRV_CONN *)ts_conn->linkd;
		web_conn = (WEB_SRV_CONN *)ts_conn->linkd;
//        uint8 *cstr = &web_conn->msgbuf[web_conn->msgbuflen];
        {
           uint8 *vstr = os_strchr(cstr, '=');
           if(vstr != NULL) {
        	   *vstr++ = '\0';
        	   web_int_vars(ts_conn, cstr, vstr);
        	   return;
           }
        }
#if DEBUGSOO > 3
        os_printf("[%s]\n", cstr);
#endif
        ifcmp("start") tcp_puts("0x%08x", web_conn->udata_start);
        else ifcmp("stop") tcp_puts("0x%08x", web_conn->udata_stop);
        else ifcmp("xml_") {
            cstr+=4;
            web_conn->udata_start&=~3;
            ifcmp("ram") tcp_puts("0x%08x", *((uint32*)web_conn->udata_start));
#ifdef USE_MODBUS
            else ifcmp("mdb") {
            	web_conn->udata_start &= 0xffff;
      			web_conn->udata_stop &= 0xffff;
      			if(web_conn->udata_stop <= web_conn->udata_start) web_conn->udata_stop = web_conn->udata_start + 10;
      			if(cstr[3] == 'h')	{
      				ts_conn->flag.user_option1 = 0;
      				ts_conn->flag.user_option2 = 1;
      			}
      			else if(cstr[3] == 'x')	{
      				ts_conn->flag.user_option1 = 1;
      				ts_conn->flag.user_option2 = 1;
      			}
      			else if(cstr[3] == 's')	{
      				ts_conn->flag.user_option1 = 1;
      				ts_conn->flag.user_option2 = 0;
      			}
      			else {
      				ts_conn->flag.user_option1 = 0;
      				ts_conn->flag.user_option2 = 0;
      			}
      			web_modbus_xml(ts_conn);
            }
#endif
            else tcp_put('?');
            web_conn->udata_start += 4;
        }
#ifdef USE_MODBUS
        else ifcmp("mdb") {
        	if(cstr[3]=='_') {
            	cstr+=4;
            	struct tcp_pcb *pcb = NULL;
            	if(mdb_tcp_conn != NULL) pcb = mdb_tcp_conn->pcb;
            	ifcmp("remote") {
       				if(pcb != NULL) {
       					tcp_puts(IPSTR ":%d", IP2STR(&(pcb->remote_ip.addr)), pcb->remote_port);
       				}
            		else tcp_strcpy_fd("none");
            	}
#ifndef USE_TCP2UART
            	else ifcmp("host") {
        			if(pcb != NULL) {
            			tcp_puts(IPSTR ":%d", IP2STR(&(pcb->local_ip.addr)), pcb->local_port);
            		}
            		else tcp_strcpy_fd("closed");
            	}
#endif
#ifdef USE_RS485DRV
            	else ifcmp("trn") {
            		if(cstr[3]=='s') tcp_puts("%u", MDB_TRN_MAX);
            		else if(cstr[3]=='a') tcp_puts("%u", MDB_BUF_MAX);
                	else tcp_put('?');
            	}
#endif
            	else tcp_put('?');
        	}
        	else if(cstr[3]=='a') {
            	cstr+=4;
        		if((*cstr>='0')&&(*cstr<='9')) {
        			uint32 addr = ahextoul(cstr);
        			if(addr < 0x10000) {
        				uint32 val = 0;
        				uint32 i = 16;
        				while(i--) {
        					if(RdMdbData((uint8 *)&val, addr++, 1) != 0) break;
        					if(val&0xFF) tcp_put(val);
        					else break;
        					if(val>>8) tcp_put(val>>8);
        					else break;
        				}
        			}
        		}
        		else tcp_put('?');
        	}
        	else if(cstr[3]=='u' || cstr[3]=='s' || cstr[3]=='h' || cstr[3]=='x') {
        		cstr+=5;
        		if((*cstr>='0')&&(*cstr<='9')) {
        			uint32 addr = ahextoul(cstr);
        			if(addr < 0x10000) {
        				uint32 val = 0;
        				if(cstr[-1]=='w') {
        					if(RdMdbData((uint8 *)&val, addr, 1) != 0) tcp_put('?');
        					else if (cstr[-2]=='u') tcp_puts("%u", val);
        					else if (cstr[-2]=='s') tcp_puts("%d", (val&0x8000)? val | 0xFFFF0000 : val);
        					else if (cstr[-2]=='h') tcp_puts("%04x", val);
        					else if (cstr[-2]=='x') tcp_puts("0x%04x", val);
        				}
        				else if(cstr[-1]=='d') {
        					if(RdMdbData((uint8 *)&val, addr, 2) != 0) tcp_put('?');
        					else if (cstr[-2]=='u') tcp_puts("%u", val);
        					else if (cstr[-2]=='s') tcp_puts("%d", val);
        					else if (cstr[-2]=='h') tcp_puts("%08x", val);
        					else if (cstr[-2]=='x') tcp_puts("0x%08x", val);
        				}
        				else tcp_put('?');
        			}
        			else tcp_put('?');
    			}
    			else tcp_put('?');
        	};
        }
#endif
        else ifcmp("sys_") {
          cstr+=4;
          ifcmp("cid") tcp_puts("%08x", system_get_chip_id());
          else ifcmp("fid") tcp_puts("%08x", spi_flash_get_id());
          else ifcmp("fsize") tcp_puts("%u", spi_flash_real_size()); // flashchip->chip_size
          else ifcmp("sdkver") tcp_puts(system_get_sdk_version());
          else ifcmp("sysver") tcp_strcpy_fd(SYS_VERSION);
          else ifcmp("webver") tcp_strcpy_fd(WEB_SVERSION);
          else ifcmp("heap") tcp_puts("%u", system_get_free_heap_size());
          else ifcmp("adc") {
        	  uint16 x[4];
        	  read_adcs(x, 4, 0x00808);
        	  tcp_puts("%u", x[0]+x[1]+x[2]+x[3]); // 16 бит ADC :)
          }
          else ifcmp("time") tcp_puts("%u", system_get_time());
          else ifcmp("rtctime") tcp_puts("%u", system_get_rtc_time());
          else ifcmp("mactime") {
        	  union {
        	  		uint32 dw[2];
        	  		uint64 dd;
        	  	}ux;
        	  ux.dd = get_mac_time();
        	  tcp_puts("0x%08x%08x", ux.dw[1], ux.dw[0]);
          }
          else ifcmp("vdd33") tcp_puts("%u", readvdd33()); // system_get_vdd33() phy_get_vdd33();
          else ifcmp("vdd") tcp_puts("%u", system_get_vdd33()); //  phy_get_vdd33();
          else ifcmp("wdt") tcp_puts("%u", ets_wdt_get_mode());
          else ifcmp("res_event") tcp_puts("%u", rtc_get_reset_reason()); // 1 - power/ch_pd, 2 - reset, 3 - software, 4 - wdt ...
          else ifcmp("rst") tcp_puts("%u", system_get_rst_info()->reason);
          else ifcmp("clkcpu") tcp_puts("%u", ets_get_cpu_frequency());
          else ifcmp("sleep_old") tcp_puts("%u", deep_sleep_option); // если нет отдельного питания RTC и deep_sleep не устанавливался/применялся при текущем включения питания чипа, то значение неопределенно (там хлам).
//          else ifcmp("test") { };
          else ifcmp("reset") web_conn->web_disc_cb = (web_func_disc_cb)_ResetVector;
          else ifcmp("restart") web_conn->web_disc_cb = (web_func_disc_cb)system_restart;
          else ifcmp("ram") tcp_puts("0x%08x", *((uint32 *)(ahextoul(cstr+3)&(~3))));
          else ifcmp("rdec") tcp_puts("%d", *((uint32 *)(ahextoul(cstr+4)&(~3))));
//          else ifcmp("reg") tcp_puts("0x%08x", IOREG(ahextoul(cstr+3)));
          else ifcmp("ip") {
/*        	  uint32 cur_ip = 0;
        	  if(netif_default != NULL) cur_ip = netif_default->ip_addr.addr; */
        	  uint32 cur_ip = ts_conn->pcb->local_ip.addr;
//        	  if(cur_ip == 0) cur_ip = 0x0104A8C0;
			  tcp_puts(IPSTR, IP2STR(&cur_ip));
          }
          else ifcmp("url") get_new_url(ts_conn);
          else ifcmp("debug") tcp_puts("%u", system_get_os_print()&1); // system_set_os_print
          else ifcmp("const_") {
        	  cstr += 6;
        	  ifcmp("faddr") {
        		  tcp_puts("0x%08x", esp_init_data_default_addr);
        	  }
        	  else tcp_puts("%u", read_sys_const(ahextoul(cstr)));
          }
          else ifcmp("ucnst_") tcp_puts("%u", read_user_const(ahextoul(cstr+6)));
#ifdef USE_NETBIOS
          else ifcmp("netbios") {
       		  if(syscfg.cfg.b.netbios_ena) tcp_strcpy(netbios_name);
          }
#endif
          else tcp_put('?');
        }
        else ifcmp("cfg_") {
			cstr += 4;
			ifcmp("web_") {
				cstr += 4;
				ifcmp("port") tcp_puts("%u", syscfg.web_port);
	        	else ifcmp("twrec") tcp_puts("%u", syscfg.web_twrec);
	        	else ifcmp("twcls") tcp_puts("%u", syscfg.web_twcls);
				else ifcmp("twd") tcp_put((syscfg.cfg.b.web_time_wait_delete)? '1' : '0');
				else tcp_put('?');
			}
		    else ifcmp("tcp_") {
		    	cstr+=4;
		    	ifcmp("tcrec") tcp_puts("%u", syscfg.tcp_client_twait);
#ifdef USE_TCP2UART
	        	else ifcmp("port") tcp_puts("%u", syscfg.tcp2uart_port);
	        	else ifcmp("twrec") tcp_puts("%u", syscfg.tcp2uart_twrec);
	        	else ifcmp("twcls") tcp_puts("%u", syscfg.tcp2uart_twcls);
	        	else ifcmp("url") {
	        		if(tcp_client_url == NULL) tcp_puts("none");
	        		else tcp_puts("%s", tcp_client_url);
	        	}
	        	else ifcmp("reop") tcp_put((syscfg.cfg.b.tcp2uart_reopen)? '1' : '0');
#endif
		    	else tcp_put('?');
		    }
		    else ifcmp("co2_") {
	        	cstr += 4;
		        ifcmp("csv_delim") tcp_puts("%c", cfg_co2.csv_delimiter);
		        else ifcmp("rf_channel") tcp_puts("%d", cfg_co2.sensor_rf_channel);
		        else ifcmp("address_LSB") tcp_puts("0x%X", cfg_co2.address_LSB);
		        else ifcmp("fans") tcp_puts("%d", cfg_co2.fans);
		        else ifcmp("fan_speed_threshold") {
		        	int16_t i;
		        	for(i = 0; i < FAN_SPEED_MAX; i++) tcp_puts("%u%s", cfg_co2.fan_speed_threshold[i], i < FAN_SPEED_MAX-1 ? "," : "");
		        }
		        else ifcmp("night_start") {
		        	cstr += 11;
		        	ifcmp("_wd") tcp_puts("%04u", cfg_co2.night_start_wd);
		        	else tcp_puts("%04u", cfg_co2.night_start);
		        }
		        else ifcmp("night_end") {
		        	cstr += 9;
		        	ifcmp("_wd") tcp_puts("%04u", cfg_co2.night_end_wd);
		        	else tcp_puts("%04u", cfg_co2.night_end);
		        }
		        else ifcmp("fans_speed_override") tcp_puts("%d", cfg_co2.fans_speed_override);
		    }
		    else ifcmp("fan_") {
	        	cstr += 4;
	        	CFG_FAN *f = &cfg_fans[Web_cfg_fan_];
		        ifcmp("rf_channel") tcp_puts("%d", f->rf_channel);
		        else ifcmp("address_LSB") tcp_puts("0x%X", f->address_LSB);
		        else ifcmp("speed_min") tcp_puts("%d", f->speed_min);
		        else ifcmp("speed_max") tcp_puts("%d", f->speed_max);
		        else ifcmp("override_at_night") tcp_puts("%d", f->override_at_night);
		        else ifcmp("speed_night") tcp_puts("%d", f->speed_night);
		        else ifcmp("flags") tcp_puts("%d", f->flags);
		    }
	        else ifcmp("iot_") {
	        	cstr += 4;
	        	ifcmp("cloud_enable") tcp_puts("%d", cfg_co2.iot_cloud_enable);
	            else ifcmp("ini") {
	        		web_conn->udata_start = 0; // pos in the file
	        		web_conn->udata_stop = WEBFSOpen(iot_cloud_ini); // file handle
	            	web_callback_textfile(ts_conn);
	            }
	        }
#ifdef USE_MODBUS
		    else ifcmp("mdb_") {
		    	cstr+=4;
		    	ifcmp("port") tcp_puts("%u", syscfg.mdb_port);
		    	else ifcmp("twrec") tcp_puts("%u", syscfg.mdb_twrec);
		    	else ifcmp("twcls") tcp_puts("%u", syscfg.mdb_twcls);
	        	else ifcmp("url") {
	        		if(tcp_client_url == NULL) tcp_puts("none");
	        		else tcp_puts("%s", tcp_client_url);
	        	}
	        	else ifcmp("reop") tcp_put((syscfg.cfg.b.mdb_reopen)? '1' : '0');
	        	else ifcmp("id") tcp_puts("%u", syscfg.mdb_id);
		    	else tcp_put('?');
		    }
#endif
			else ifcmp("overclk") tcp_put((syscfg.cfg.b.hi_speed_enable)? '1' : '0');
			else ifcmp("pinclr") tcp_put((syscfg.cfg.b.pin_clear_cfg_enable)? '1' : '0');
			else ifcmp("debug") tcp_put((syscfg.cfg.b.debug_print_enable)? '1' : '0');
#ifdef USE_NETBIOS
			else ifcmp("netbios") tcp_put((syscfg.cfg.b.netbios_ena)? '1' : '0');
#endif
#ifdef USE_SNTP
			else ifcmp("sntp") tcp_put((syscfg.cfg.b.sntp_ena)? '1' : '0');
#endif
#ifdef USE_CAPTDNS
			else ifcmp("cdns") tcp_put((syscfg.cfg.b.cdns_ena)? '1' : '0');
#endif
		    else tcp_put('?');
		}
        else ifcmp("wifi_") {
          cstr+=5;
          ifcmp("rdcfg") Read_WiFi_config(&wificonfig, WIFI_MASK_ALL);
          else ifcmp("newcfg") {
/*        	  if(CheckSCB(SCB_WEBSOC)) {
        		  tcp_puts("%d",New_WiFi_config(WIFI_MASK_ALL));
        	  }
        	  else { */
        		  web_conn->web_disc_cb = (web_func_disc_cb)New_WiFi_config;
        		  web_conn->web_disc_par = WIFI_MASK_ALL;
//        	  }
          }
//          else ifcmp("csta") tcp_puts("%d", wifi_station_get_connect_status());
          else ifcmp("mode") tcp_puts("%d", wifi_get_opmode());
          else ifcmp("phy") tcp_puts("%d", wifi_get_phy_mode());
//          else ifcmp("chl") tcp_puts("%d", wifi_get_channel());
          else ifcmp("sleep") tcp_puts("%d", wifi_get_sleep_type());
          else ifcmp("scan") web_wscan_xml(ts_conn);
          else ifcmp("prrq_xml") web_ProbeRequest_xml(ts_conn);
//          else ifcmp("aucn") tcp_puts("%d", wifi_station_get_auto_connect());
//          else ifcmp("power") { rom_en_pwdet(1); tcp_puts("%d", rom_get_power_db()); }
//          else ifcmp("noise") tcp_puts("%d", get_noisefloor_sat()); // noise_init(), rom_get_noisefloor(), ram_get_noisefloor(), ram_set_noise_floor(),noise_check_loop(), read_hw_noisefloor(), ram_start_noisefloor()
//          else ifcmp("hwnoise") tcp_puts("%d", read_hw_noisefloor());
/*          else ifcmp("fmsar") { // Test!
        	  rom_en_pwdet(1); // ?
        	  tcp_puts("%d", ram_get_fm_sar_dout(ahextoul(cstr+5)));
          } */
          else ifcmp("rfopt") tcp_puts("%u",(RTC_RAM_BASE[24]>>16)&7); // system_phy_set_rfoption | phy_afterwake_set_rfoption(option); 0..4
          else ifcmp("vddpw") tcp_puts("%u", phy_in_vdd33_offset); // system_phy_set_tpw_via_vdd33(val); // = pphy_vdd33_set_tpw(vdd_x_1000); Adjust RF TX Power according to VDD33, unit: 1/1024V, range [1900, 3300]
          else ifcmp("maxpw") tcp_puts("%u", phy_in_most_power); // read_sys_const(34));// system_phy_set_max_tpw(val); // = phy_set_most_tpw(pow_db); unit: 0.25dBm, range [0, 82], 34th byte esp_init_data_default.bin
          else ifcmp("aps_") {
        	  cstr+=4;
        	  ifcmp("xml") wifi_aps_xml(ts_conn);
              else ifcmp("id") tcp_puts("%d", wifi_station_get_current_ap_id());
              else tcp_put('?');
/*
        	  struct station_config config[5];
        	  int x = wifi_station_get_ap_info(config);
              if(cstr[1] != '_' || cstr[0]<'0' || cstr[0]>'4' ) {
            	  ifcmp("cnt") tcp_puts("%d", x);
            	  else tcp_put('?');
              }
              int i = cstr[0]-'0';
       	      if(i < x) {
       	    	  ifcmp("ssid") tcp_htmlstrcpy(config[i].ssid, sizeof(config[0].ssid));
       	    	  else ifcmp("psw") tcp_htmlstrcpy(config[i].password, sizeof(config[0].password));
       	    	  else ifcmp("sbss") tcp_puts("%d", config[i].bssid_set);
       	      	  else ifcmp("bssid") tcp_puts(MACSTR, MAC2STR(config[i].bssid));
              	  else tcp_put('?');
       	      }
        	  else ifcmp("id") wifi_aps_xml(ts_conn); */
          }
          else {
            uint8 if_index;
            ifcmp("ap_") if_index = SOFTAP_IF;
            else ifcmp("st_") if_index = STATION_IF;
            else { tcp_put('?'); return; };
            cstr+=3;
			struct ip_info wifi_info;
            if(if_index == SOFTAP_IF) {
            	// SOFTAP_MODE
            	ifcmp("dhcp") tcp_puts("%d", (dhcps_flag==0)? 0 : 1);
				else ifcmp("mac") {
					uint8 macaddr[6];
					wifi_get_macaddr(if_index, macaddr);
					tcp_puts(MACSTR, MAC2STR(macaddr));
				}
				else {
					uint8 opmode = wifi_get_opmode();
#ifndef USE_OPEN_DHCPS
					struct dhcps_lease dhcps_lease = wificonfig.ap.ipdhcp;
					wifi_softap_get_dhcps_lease(&dhcps_lease);
#endif
					if (((opmode & SOFTAP_MODE) == 0) || (!wifi_get_ip_info(SOFTAP_IF, &wifi_info))) {
						wifi_info = wificonfig.ap.ipinfo;
#ifdef USE_OPEN_DHCPS
						dhcps_lease = wificonfig.ap.ipdhcp;
#endif
//						p_dhcps_lease->start_ip = htonl(wificonfig.ap.ipdhcp.start_ip);
//						p_dhcps_lease->end_ip = htonl(wificonfig.ap.ipdhcp.end_ip);
//						p_dhcps_lease->start_ip = wificonfig.ap.ipdhcp.start_ip;
//						p_dhcps_lease->end_ip = wificonfig.ap.ipdhcp.end_ip;
					}
					ifcmp("sip") tcp_puts(IPSTR, IP2STR((struct ip_addr *)&dhcps_lease.start_ip));
					else ifcmp("eip") tcp_puts(IPSTR, IP2STR((struct ip_addr *)&dhcps_lease.end_ip));
					else ifcmp("ip") tcp_puts(IPSTR, IP2STR(&wifi_info.ip));
					else ifcmp("gw") tcp_puts(IPSTR, IP2STR(&wifi_info.gw));
					else ifcmp("msk") tcp_puts(IPSTR, IP2STR(&wifi_info.netmask));
					else {
						struct softap_config wicfgap;
						if(((opmode & SOFTAP_MODE) == 0) || (!wifi_softap_get_config(&wicfgap)) ) wicfgap = wificonfig.ap.config;
						ifcmp("ssid") tcp_htmlstrcpy(wicfgap.ssid, sizeof(wicfgap.ssid));
						else ifcmp("psw") tcp_htmlstrcpy(wicfgap.password, sizeof(wicfgap.password));
						else ifcmp("chl") tcp_puts("%d", wicfgap.channel);
						else ifcmp("auth") tcp_puts("%d", wicfgap.authmode);
						else ifcmp("hssid") tcp_puts("%d", wicfgap.ssid_hidden);
						else ifcmp("mcns") tcp_puts("%d", wicfgap.max_connection);
						else ifcmp("bint") tcp_puts("%d", wicfgap.beacon_interval);
						else tcp_put('?');
					};
				};
            }
            else { 
            	// STATION_MODE
            	ifcmp("dhcp") tcp_puts("%d", (dhcpc_flag==0)? 0 : 1);
            	else ifcmp("rssi") tcp_puts("%d", wifi_station_get_rssi());
    	        else ifcmp("aucn") tcp_puts("%d", wifi_station_get_auto_connect());
				else ifcmp("sta") tcp_puts("%d", wifi_station_get_connect_status());
	            else ifcmp("rect") tcp_puts("%u", wificonfig.st.reconn_timeout);
                else ifcmp("hostname") { if(hostname != NULL) tcp_puts(hostname); else tcp_puts("none"); }
                else ifcmp("mac") {
					uint8 macaddr[6];
					wifi_get_macaddr(if_index, macaddr);
                	tcp_puts(MACSTR, MAC2STR(macaddr));
                }
            	else {
					uint8 opmode = wifi_get_opmode();
                	if (((opmode & STATION_MODE) == 0) || (!wifi_get_ip_info(STATION_IF, &wifi_info))) wifi_info = wificonfig.st.ipinfo;
                    ifcmp("ip") tcp_puts(IPSTR, IP2STR(&wifi_info.ip));
                    else ifcmp("gw") tcp_puts(IPSTR, IP2STR(&wifi_info.gw));
                    else ifcmp("msk") tcp_puts(IPSTR, IP2STR(&wifi_info.netmask));
                    else {
                        struct station_config wicfgs;
                        if(((opmode & STATION_MODE) == 0) || (!wifi_station_get_config(&wicfgs)) ) wicfgs = wificonfig.st.config;
                        ifcmp("ssid") tcp_htmlstrcpy(wicfgs.ssid, sizeof(wicfgs.ssid));
                        else ifcmp("psw") tcp_htmlstrcpy(wicfgs.password, sizeof(wicfgs.password));
                        else ifcmp("sbss") tcp_puts("%d", wicfgs.bssid_set);
